# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами. 
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

import random

lst = [random.randint(0,100) for _ in range(10)]
lst2 = [lst[_]*lst[_] for _ in range(10)]

print(lst2)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

fruits_1 = ['Абиу', 'Абрикос', 'Авокадо', 'Айва', 'Аки', 'Алиберция', 'Алыча', 'Амбарелла', 'Американский абрикос']
fruits_2 = ['Абиу', 'Аки', 'Алиберция', 'Алыча', 'Амбарелла', 'Американский абрикос', 'Американский орех', 'Ананас']

fruits_3 = [i for i in fruits_1 if [ j for j in fruits_2 if j == i]]

print(fruits_3)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

import random

lst = [random.randint(-100,100) for _ in range(20)]
print(lst)

lst2 = [el for el in lst if el % 3 == 0 or el > 0 or el % 4 != 0]
print(lst2)
