# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

lst = ["яблоко", "банан", "киви", "арбуз"]

n = 1
for i in lst:
    print('{}.  {:>6}'.format(n, i))
    n+=1

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

list1 = []
list2 = []
list3 = []

# Заполнение списка v1
n = int(input('Введите числовые значения списка 1: '))
while True:
    try:
        list1.append(n)
        n = int(input('-->> '))
    except:
        break
print("Список 1: ",list1)

# Заполнение списка v2
list2 = [int(m) for m in input('Введите значения списка 2 через пробел..').split()]
print("Список 2: ",list2)

list1 = list(set(list1))
print("Список 1 без дублей", list1)


for a in list1:
    if a not in list2:
        list3.append(a)

list1 = list3

print("Список 1:", list1)

# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

import random

list3 = [random.randint(0, 100) for i in range(int(input("Укажите размер списка --> ")))]
print("Исходный список", list3)

for i in list3:

    if i % 2 == 0:
        list3[list3.index(i)] = i / 4
    else:
        list3[list3.index(i)] = i * 2

print("Результирующий список", list3)