

__author__ = 'Дьяченко Даниил Анатольевич'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

i = list(input("Дано произвольное целое число..."))
n_max = 0
n = 0

while n < len(i)-1 :

    if n_max < int(i[n]):
        n_max = int(i[n])
           
    n += 1
print('Максимальная цифра ', n_max)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.


# 2.1 Решение с реверсом списка
print("Укажите исходные значения переменных: ")
a = [input(), input()]
a.reverse()
print("Значения переменных изменены:", a)


# 2.2 Решение через кортеж. 
print("Укажите исходные значения переменных: ")
a = (input(), input())
print(a)

b = a[::-1]  
# Альтернативный путь 
# b = reversed(a) 
# , но содержание b выглядит как область памяти (<reversed object at 0x10b4df400>) 
# и обязательно нужно явно указывать  tuple(b) Поясните различия, плз.

print("Значения переменных изменены:", tuple(b))


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math

print("Для вычисления корней уравнения укажите значения переменных ax² + bx + c = 0")

a = int(input("a = "))
b = int(input("b = "))
c = int(input("c = "))

if a == 0:
    print("Ошибка. a не должно быть равно 0")

d = (b**2) - (4 * a* c)

if d < 0:
    print('Корней нет')
elif d == 0:
    x = b/(2*a)*(-1)
    print('Корни x1 и x2 равны ', x)
else:
    x1 = ((-1)*b - math.sqrt(b**2-4*a*c))/(2*a)
    x2 = ((-1)*b + math.sqrt(b**2-4*a*c))/(2*a)
    print('Корни равны: x1 = ', x1, 'x2 = ', x2)