__author__ = 'Дьяченко Даниил Анатольевич'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)

a = float('inf')

print(a == a**2)
print(a == a*2)
print(a > 999999)

print(a == float('Inf')**23467658*564756)

# Сам бы не догадался. Пришлось гуглить. 
# Правильно я понял, что бесконечность обозначается через Значение с плавающей запятой float('inf') 
# и не модет быть int или другим типом данных?