__author__ = 'Дьяченко Даниил Анатольевич'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...

i = list(input("Дано произвольное целое число..."))
n = 0

while n < len(i) :
    print(i[n])
    n += 1


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input()
b = input()
c = 0

print("Исходные значения переменных: a = ",a,'; b = ',b)

c = a
a = b
b = c

print("Значения переменных изменены: a = ",a,'; b = ',b)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

a = int(input("Сколько Вам полных лет? "))

if a >= 18 :
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")
    

